const  data = {
  operation_name: "Операція (Цех №1) 🪵[Каркас - нарізана деревина] (100ДСП Механізм)",
  PriceRate: 1,
  workCenter: {
    "id": 4,
    "name": "Цех №1 Дерева (нарізка)",
    "code": "Ц1дрв",
  },
  BOM: {
    temp: "🪵[Каркас - нарізана деревина]",
    atr_val: "100ДСП Механізм",
    attribute_ids: [ 
      {
        id: 13,
        name: "Модель"
      }
    ],
    components: [
      {
        name: "Дерево",
        qty: 0.02,
        unt: "m³",
      }
    ],
  }
}

/* 
# Цех №7 Закройка Тканини - Ц7зкр “Операція (Цех №7)”

🧩[Чохол - нарізані матеріали] (Д.Нео-3 Механізм - зменшене бильце, Рене 4)
  [Синтепон] (400) - 14.00 m
  [Тканина] (Рене 4) - 17.50 m
  [Флізелін] (60) - 16.5 m

*/

const  data2 = {
  operation_name: "Операція (Цех №7) 🧩[Чохол - нарізані матеріали] (Д.Нео-3 Механізм - зменшене бильце, Рене 4)",
  PriceRate: 1,
  workCenter: {
    id: 4,
    name: "Цех №1 Дерева (нарізка)",
    code: "Ц1дрв",
  },
  BOM: {
    temp: "🪵[Каркас - нарізана деревина]",
    atr_val: "100ДСП Механізм",
    attribute_ids: [ 
      {
        id: 13,
        name: "Модель"
      }
    ],
    components: [
      {
        name: "Дерево",
        qty: 0.02,
        unt: "m³",
      }
    ],
  }
}

// ----------

WorkCenters +

Product
  Temp - 🪵[Каркас - нарізана деревина]
  Atr + Модель
    val_atr - 100ДСП Механізм

  variants[
    + 🪵[Каркас - нарізана деревина] (100ДСП Механізм)
  ] 

  BOM -
    components [...variants]
      /*
        Дерево - 0.02 m³
      */


operation - (BOM + WorkCenters)

operation_name = `${operation} ${variant}` = "Операція (Цех №1) 🪵[Каркас - нарізана деревина] (100ДСП Механізм)"

+ ПРАВИЛО ПОПОВНЕННЯ 
вказуэться варіант товару
маршрут виробництво

------------
Ми знаходимо стрічку "# Цех №1 Дерева (нарізка) - Ц1дрв “Операція (Цех №1)”"
"Цех №1 Дерева (нарізка)" - це назва існуючого робочого центру
 - по цій назві можна знайти ID робочого центру і запамятовуємо.

Вертаємося в документ:
Під цим заголовком ми знаходимо стрічку "🪵[Каркас - нарізана деревина] (100ДСП Механізм)"
"🪵[Каркас - нарізана деревина]" - це назва продукту (шаблон)
- по цій назві можна знайти ID товару. 

коли ми знайшли дивимося його атрибути.
в атрибуті шукаємо значення "100ДСП Механізм", якщо немає то створюємр значення для цього атрибуту
і додаємо це значення в знайдений атрибут  наприклад "Модель" в товар  "🪵[Каркас - нарізана деревина]"

коли ми додали значення Odoo автоматично генерує варіант товару. який буде вигдялати так "🪵[Каркас - нарізана деревина] (100ДСП Механізм)"
після цього кроку створюємо Специфікацю (BOM).

в Bom ми назначаємо 
"Товар" - "Цех №1 Дерева (нарізка)"
 і "Варіант Товару" - "🪵[Каркас - нарізана деревина] (100ДСП Механізм)"

Вертаємося в документ:

 далі заповнюємо Компоненти Специфікації їх беремо з строчки нижче
 "Дерево - 0.02 m³"

 "Дерево" - це назва продукту
 
1) Спочтку ми шукаємо його в базі Odoo якщо не знаходимо то створюємо новий з такой назвою
 "m³" - це одиниці вимірювання яку треба зазначити при створені.

2) Якщо є то вибираємо саме з бази Оду. 
в кількості зазначаємо саме ту яка є в стрічці "0.02"
і зазначаємо правильні одиниці вимірювання з стрічки "m³"

і так по всьому списку який йде далі...
коли список закінчився то переходимо до створеню операції

Вертаємося в документ:

згадуємо стрчку "# Цех №1 Дерева (нарізка) - Ц1дрв “Операція (Цех №1)”"

"Операція (Цех №1)" - це є перша частина назви операції
друга частина - це назва варіанту товару "🪵[Каркас - нарізана деревина] (100ДСП Механізм)"

Генеруємо правильну назву - "Операція (Цех №1) 🪵[Каркас - нарізана деревина] (100ДСП Механізм)"
саме її зазначаємо в назві операції, далі вказуємо потрібний робочий центр 
і обираємо потрібну специфікацію (BOM) яку раніше створили ""


